Merge pull request #47 from Fenrir784/test
Year tag, format setting simplification
